var idoms=['اللهم إني أعوذ بك من يوم السوء، ومن ليلة السوء ومن ساعة السوء، ومن صاحب السوء، ومن جار السوء في دار المقامة.',
'اللهم إني أعوذ بك من العجز والكسل والجبن والهرم والبخل وأعوذ بك من عذاب القبر ومن فتنة المحيا والممات.',
'اللهم إني أعوذ بك من قلب لا يخشع، ودعاء لا يُسمع ومن نفس لا تشبع، ومن علم لا ينفع، أعوذ بك من هؤلاء الأربع.',
'اللهم إني أسألك فعل الخيرات وترك المنكرات حُب المساكين وأن تغفر لي وترحمني، وإذا أردت فتنة قوم فتوفني غير مفتون.',
'اللهم إني أسألك يا الله بأنك الواحد الأحد الصمد الذي لم يلد ولم يولد ولم يكن له كفواً أحد أن تغفر لي ذنوبي إنك أنت الغفور الرحيم.',
'اللهم طهرني من الذنوب والخطايا اللهم نقني منها كما ينقى الثوب الأبيض من الدنس اللهم طهرني بالثلج والبرد والماء البارد.',
'اللهم آتنا في الدنيا حسنة وفي الآخرة حسنة وقنا عذاب النار.',
'اللهم إني أعوذ بك من الفقر، والقلة والذلة وأعوذ بك من أن أَظلِم أو أُظلَم.',
'يا مقلب القلوب ثبت قلبي على دينك.',
'اللهم أهدني وسددني، اللهم إني أسالك الهدى والسداد.',
'اللهم إني أعوذ بك من منكرات الأخلاق، والأعمال والأهواء.',
'اللهم إني أعوذ بك من زوال نعمتك، وتحول عافيتك، وفجاءة نقمتك، وجميع سخطك.',
'اللهم إني أعوذ بك من جار السوء في الدار المقامة، فإن جار البادية يتحول.',
'اللهم إني أعوذ بك من شر ما عملت ومن شر ما لم أعمل.',
'اللهم أكثر مالي وولدي وبارك لي فيما أعطيتني.',
'اللهم إني أسألك الجنة وأستجير بك من النار.',
'اللهم رحمتك أرجو فلا تكلني إلى نفسي طرفة عين، وأصلح لي شأني كله، لا إله إلا أنت.',
'اللهم إنك عفو كريم تحب العفو فاعف عني.',
'اللهم إني أسألك عيشة نقية وميتة سوية ومرداً غير مخزٍ ولا فاضح.',
'اللهم قنعني بما رزقتني وبارك لي فيه واخلف عليَّ كل غائبة لي بخير.',
'اللهم متعني بسمعي وبصري واجعلهما الوارث منيِّ وانصرني على من يظلمُني ، وخذ منه بثأري.',
'اللهم إني أعوذ بك من علم لا ينفع، ومن قلب لا يخشع ومن نفس لا تشبع، ومن دعوة لا يستجاب لها.',
'اللهم اجعل أوسع رزقك عليّ عند كبر سني، وانقطاع عمري.',
'اللهمَّ آلف بين قلوبِنا، وأصلِح ذاتَ بيننا، واهدِنا سُبل السلام، ونجِنا من الظلماتِ إلى النور، وجنّبنا الفواحِش، وبارِك لنا في أسماعنا، وأبصارنا، وقلوبنا، وأزواجنا، وذرياتنا، وتُب علينا إنك أنتَ التواب الرحيم.',
'ربي إذا ابتليتني بمعصيةٍ لا تبتليني ذنب المُجاهرةِ بها، رب أينما كان الهُدى اجعلهُ طريقي، وأينما كان الرِضا اجعلهُ رفيقي، وأينما كانت السعادة إجعلها في قلبي.',
'اللهمَ اكتب لي تغيراً للأفضل في نفسي وحالي، وحقّق لي ما أتمنى ولا تجعلني وجعًا ولا عبئاً لأحد.',
'اللهَّم إني أسالك توفيقاً في طريقي، وراحةً في نفسي، وتَيسيراً في أمري، ربّ أعوذ بك من شَتاتِ الأمر، ومسّ الضُّر، وضيق الصدر.',
'اللهمَّ إنّي أستغفرك من كلّ ذنبٍ يعقب الحسرة و يُورث الندامة، ويَرُد الدعاء ويحبس الرزق، ربّ إن كان هناك ذنب يحول بيني وبين تيسير أموري فاغفرهُ لي.',
'اللهمَّ اهدنا، اللهمَّ اهدنا، اللهمَّ اهدنا هدايةً لا نرتَدُ بعدها أبداً، وأسعدنا سعادةً لا نشقى بعدها أبداً، وأنزل علينا رحمتك يا ربّ العالمين.',
'يا رَب استجب لي ما أعجز عن قولهِ، أنت أعلم بكلِ دعوةٍ تحتبس في قلبي ولا أعرف كيف أرفعها إليك.',
'اللهمَّ اجعل خير أعمالنا خواتمها، وخير أعمارنا أواخرها، وخير أيامنا يوم نلقاك، اللهمَّ اغفر لنا ما مضى وأصلح لنا ما تبقى.',
'ربّ لا تجعل أعيننا صغيرةً لا ترى إلا الدُنيا، ولا تجعل قلوبنا ضيّقة لا تفكر إلا بالبشر، اللهمَّ اجعلنا أوسع نظرًا وأرقى فكرًا نرى الجنة ونعمل لها.',
'يا رب أخشى أن أموت فجأة دون أن أتوب توبةً في قلبي، يا رب اغفر لي إذا مت، وسَخِر لي من يدعو لي دون ملل.',
'ربي أينما كان الهُدى فاجعله طريقي، وأينما كان الرِضا فاجعلهُ رفيقي، وأينما كانت السعادة فاجعلها في قلبي.',
'ربي اجعلني خيراً ممّا يظنون واغفر لي ما لا يعلمون، ربّ استودعتك ايامي القادمه فاكتب لي فيها كُل خير، وادفع عنّي كُل شر وبلاء.',
'اللهمَّ إني أسألك عيشةً نقية، وميتةَ سوية، ومرداً غير مخز ولا فاضح، يارب أعطني بقدرِ نيتي فإني لا أنوي بأحد إلا خيرًا، وارزقني أجمل ممّا أتمنى، وأكثر ممّا أتوقّع، وأفضل ممّا أدعو.',
'ربّي بشّرني بما يَسرّني، وكف عني ما يَضرّني، وثبت يقيني، وارزقني حلالاً يكفيني، وأبعد عنّي كل شيء يؤذيني، اللهمَّ آمين.',
'اللهمَّ لك أسلمت، وبك آمنت، وعليك توكّلت، وإليك أنبت، وبك خاصمت، اللهمَّ إني أعوذ بعزتك لا إله ‏إلا أنت أن تضلّني أنت الحي الذي لا يموت والجن والإنس يموتون.',
'اللهمَّ إني أسألك من الخيرِ كُلِه عاجلهِ وآجلهِ، ما علمت مِنهُ وما لم أعلم، وأعوذ بكَ من الشرِ كُله عاجلهِ ‏وآجلهِ، ما علمت منهُ وما لم أعلم، وأسألك مما سألك عبدك ورسولك محمد صلّى الله عليه وسلم، ‏وأعوذ بك من شرّ ما عاذ بهِ عبدك ورسولك محمد صلّى الله عليهِ وسلم، وأسألك الجنة وما قرب إليها ‏من قولٍ أو عملٍ، وأعوذ بكَ من النارِ وما قُرِب إليها من قولٍ أو عملٍ.',
'وأسألك أن تجعل كلّ قضاء قضيته ‏لي خيراً لي.',
'اللهمَّ أنت ربي لا إله إلا أنت خلقتني وأنا عبدك وأنا على عهدك ووعدك ما استطعت، أعوذ بك من شرّ ‏ما صنعت أبوء لك بنعمتك علي وأبوء لك بذنبي فاغفر لي فإنّهُ لا يَغفر الذّنوب إلا أنت.',
'اللهم إني أعوذ بك من العجز والكسل والجبن والبخل والهرم والقسوة والغفلة والعلية والذلة والمسكنة وأعوذ بك من الفقر والكفر والفسوق والشقاق والنفاق والسمعة والرياء وأعوذ بك من الصمم والبكم والجنون والجزام والبرص وسيء الأسقام.',
'اللهم اني اعلم اني اعصيك ولكني احب من يطيعك فأجعل اللهم حبي لمن أطاعك شفاعة تقبل لمن عصاك.',
'اللهم حبب الينا الايمان وزينه فى قلوبنا، وكره إلينا الكفر و الفسوق و العصيان، و أجعلنا من الراشدين، و أجعلنا هداة مهتدين، غير ضالين ولا مضلين.',
'ربنا أفرغ علينا صبرا وتوفنا مسلمين، و ألحقنا بالصالحين.'];
		
var idomser = {
		init: function(){
			document.addEventListener("deviceready",idomser.repeat,false);
			idomser.repeat();
		},
		retry: 1,
		repeat: function(){
					document.getElementById("ADSFIXEDBOTTOM").style.display="block"; 
					document.getElementById("ADSFIXEDBOTTOM").innerHTML='<span style="position:absolute;left:0px;background:#128f67;height:220x;width:20px;">...</span><span onclick="desert.popup(\'دعاء\',\''+(idoms[idomser.retry])+'\');">'+(idoms[idomser.retry])+'</span>'; 
					idomser.retry++;
					if(idomser.retry>=idoms.length){idomser.retry=0;}
					setTimeout(function(){idomser.repeat();},20000);
		}
};
idomser.init();